"INFO" = "General Info";
"COPYRIGHT" = "Copyright (C) 2011 Brad Howes";
"VERSION" = "Version";
"ABOUT" = "About Datac";
"COPYRIGHTS" = "Copyrights";

"VIEWS" = "View Settings";
"VIEWS_FOOTER" = "";

"INPUT_VIEW" = "Input";
"INPUT_VIEW_UPDATE_RATE" = "Update rate (Hz)";
"INPUT_VIEW_INVERT" = "Invert Input Signal";
"INPUT_VIEW_SCALE" = "Input View Zoom";
"INPUT_VIEW_SCALE_FOOTER" = "Slide to the right to zoom in.";
"INPUT_VIEW_FOOTER" = "Update rate: number of times per second the view will update.\nMin/Max: age of samples to show.";

"DETECTIONS_VIEW" = "Detections";
"DETECTIONS_VIEW_UPDATE_RATE" = "Sample rate (Hz)";
"DETECTIONS_VIEW_DURATION" = "Duration (seconds)";
"DETECTIONS_VIEW_FOOTER" = "Sample rate: number of times per second the view will fetch values from the active signal detector.\nDuration: how many seconds of historical information to show.";

"DETECTORS" = "Detectors";
"DETECTORS_FOOTER" = "Signal processing and detection configuration.";

"LEVEL_DETECTOR" = "Level Detector";
"LEVEL_DETECTOR_LEVEL" = "Threshold";
"LEVEL_DETECTOR_SCALING" = "Scaling (1k RPM/Hz)";
"LEVEL_DETECTOR_USE_LOW_PASS_FILTER" = "Enable filter";
"LEVEL_DETECTOR_LOW_PASS_FILTER_FILENAME" = "Filter file";
"LEVEL_DETECTOR_COUNTS_DECAY_DURATION" = "Decay (seconds)";
"LEVEL_DETECTOR_FOOTER" = "Counts the number of times the input rises above a threshold.\n\nThreshold: the signal level to reach.\nScaling: convert counts to detections.\nFilter file: name of filter definition file.\nDecay: duration of decay filter.";

"PULSE_FREQUENCY_DETECTOR" = "Pulse Frequency Detector";
"PULSE_FREQUENCY_DETECTOR_LOW_LEVEL" = "Low threshold";
"PULSE_FREQUENCY_DETECTOR_HIGH_LEVEL" = "High threshold";
"PULSE_FREQUENCY_DETECTOR_MIN_HIGH_AMPLITUDE" = "Min amplitude";
"PULSE_FREQUENCY_DETECTOR_MAX_PULSE_2_PULSE_WIDTH" = "Max pulse-pulse width";
"PULSE_FREQUENCY_DETECTOR_SCALING" = "Pulse scaling";
"PULSE_FREQUENCY_DETECTOR_SMOOTHING" = "Value smoothing";
"PULSE_FREQUENCY_DETECTOR_FOOTER" = "";

"BIT_DETECTOR" = "Bit Detector";
"BIT_DETECTOR_MAX_LOW_LEVEL" = "Zero max";
"BIT_DETECTOR_MIN_HIGH_LEVEL" = "One min";
"BIT_DETECTOR_SAMPLES_PER_PULSE" = "Pulse width";
"BIT_DETECTOR_FOOTER" = "Detection logic that uses two levels to determine if the signal represents a binary 1 or 0.\n\nZero max: max signal level for a binary 0.\nOne min: min signal level for a binary 1.\nPulse width: input samples per bit pulse.";

"BIT_STREAM_FRAME_DETECTOR" = "Bit Stream Frame";
"BIT_STREAM_FRAME_DETECTOR_PREFIX" = "Prefix";
"BIT_STREAM_FRAME_DETECTOR_SUFFIX" = "Suffix";
"BIT_STREAM_FRAME_DETECTOR_CONTENT_SIZE" = "Bit count";
"BIT_STREAM_FRAME_DETECTOR_FOOTER" = "Processor that looks for valid sequences of detected bit pulses.\n\nPrefix: bit sequence at frame start.\nSuffix: bit sequence at frame end.\nBit count: number of bits after prefix and before suffix.";

"MIC_SWITCH_DETECTOR" = "Mic Switch";
"MIC_SWITCH_DETECTOR_THRESHOLD" = "Threshold";
"MIC_SWITCH_DETECTOR_DURATION" = "Duration (seconds)";
"MIC_SWITCH_DETECTOR_FOOTER" = "Detects when a microphone switch found on some headsets is pressed.\n\nThreshold: the signal level below which the switch is assumed pressed.\nDuration: the amount of time the signal must be below the Threshold value before the detector fires.";

"CLOUD_STORAGE" = "Dropbox Storage";
"CLOUD_STORAGE_FOOTER" = "Activate a service for automatic transfer of recordings. Recordings are also accessible from within Apple iTunes.";
"CLOUD_STORAGE_ENABLE" = "Enable upload";

"RECORDINGS" = "Recordings";
"RECORDINGS_FOOTER" = "The format to use for new recording files.";
"RECORDINGS_FILE_FORMAT" = "Format";
